The hash for the file is  :

https://www.virustotal.com/gui/search/C67CB167AF69111342EC637AF04D5936E959A7D945CB0A3A6806537E601C47FB

DeviceEvents
| where Timestamp > ago(7d)
| where ActionType in (
    "AntivirusDisabled",
    "TamperProtectionDisabled",
    "ServiceStopped",
    "DefenderAVHealthStatusChanged",
    "SecurityIntelligenceUpdateFailed"
)
| project Timestamp, DeviceName, ReportId, ActionType, InitiatingProcessAccountName, InitiatingProcessFileName, AdditionalFields
💡 Explanation:
